tutorials/propaneAbsorption/0/film/delta
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/film";
    object      delta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 1.0e-8;

boundaryField
{
    "(inlet|surface)"
    {
        type            zeroGradient;
    }

    outlet
    {
        /*type            turbulentInlet;
        fluctuationScale 0.05;
        referenceField  uniform 4.77e-4;
        alpha           0.1;
        value           uniform 4.77e-4;*/
        type            fixedValue;
        value           uniform 2.0e-4;
    }

    wall
    {
        type            filmContactAngle;

        contactAngle
        {
            type            constant;
            theta0          8;
        }

        value           $internalField;
    }

    "(left|right)"
    {
        type            zeroGradient;
        /*type            filmContactAngle;

        contactAngle
        {
            type            constant;
            theta0          8;
        }

        value           $internalField;*/
    }
}

// ************************************************************************* //
