tutorials/propaneAbsorption/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(top|outlet)"
    {
        type            zeroGradient;
    }

    film
    {
        type            fixedValue;
        value           uniform 298;
    }

    "(left|right)"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
