tutorials/propaneAbsorption/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.24);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.24);
    }

    outlet
    {
        type            zeroGradient;
        //type            inletOutlet; //- causes mass conservation errors
        //inletValue      uniform (0 0 0);
    }
    
    top
    {
        type            noSlip;
    }

    film
    {
        type            mappedValue;
        value           $internalField;
    }

    "(left|right)"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
