tutorials/propaneAbsorption/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.25e+5;

boundaryField
{
    "(top|inlet|film|left|right)"
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            prghPressure;
        p               $internalField;
        value           $internalField;
    }
}

// ************************************************************************* //
