tutorials/propaneAbsorption/constant/fluid/speciesThermo
species
(
    propane
);

propane
{
    specie
    {
        molWeight   44.1;
    }
    /*equationOfState
    {
        rho     1.2;
    }*/
    thermodynamics
    {
        Cp          1680;
        Hf          0;
    }
    transport
    {
        mu          8.23e-6;
        Pr          0.7;
    }
}

// ************************************************************************* //
